Revit 2027 API
IOpenFromCloudCallback.OnOpenConflict Method
 A method called when the conflict is happen during the model opening.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
OpenConflictResult OnOpenConflict(
	OpenConflictScenario scenario
)
Function OnOpenConflict (
	scenario As OpenConflictScenario
) As OpenConflictResult
OpenConflictResult OnOpenConflict(
	OpenConflictScenario scenario
)
abstract OnOpenConflict :
        scenario : OpenConflictScenario -> OpenConflictResult
Parameters
scenario OpenConflictScenario
 The scenario of the conflict.
Return Value
OpenConflictResult
 Returns the result to indicate whether to keep the unsynchronized change, or open the latest version or cancel the open action.
See Also
Reference
IOpenFromCloudCallback Interface
Autodesk.Revit.DB Namespace